tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF_PINS.h
/*******************************************************************************
* File Name: I2CIF_PINS.h
* Version 3.10
*
* Description:
*  This file provides constants and parameter values for the pin components
*  buried into SCB Component.
*
* Note:
*
********************************************************************************
* Copyright 2013-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_PINS_I2CIF_H)
#define CY_SCB_PINS_I2CIF_H

#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cytypes.h"


/***************************************
*   Conditional Compilation Parameters
****************************************/

/* Unconfigured pins */
#define I2CIF_REMOVE_RX_WAKE_SCL_MOSI_PIN  (1u)
#define I2CIF_REMOVE_RX_SCL_MOSI_PIN      (1u)
#define I2CIF_REMOVE_TX_SDA_MISO_PIN      (1u)
#define I2CIF_REMOVE_CTS_SCLK_PIN      (1u)
#define I2CIF_REMOVE_RTS_SS0_PIN      (1u)
#define I2CIF_REMOVE_SS1_PIN                 (1u)
#define I2CIF_REMOVE_SS2_PIN                 (1u)
#define I2CIF_REMOVE_SS3_PIN                 (1u)

/* Mode defined pins */
#define I2CIF_REMOVE_I2C_PINS                (0u)
#define I2CIF_REMOVE_SPI_MASTER_PINS         (1u)
#define I2CIF_REMOVE_SPI_MASTER_SCLK_PIN     (1u)
#define I2CIF_REMOVE_SPI_MASTER_MOSI_PIN     (1u)
#define I2CIF_REMOVE_SPI_MASTER_MISO_PIN     (1u)
#define I2CIF_REMOVE_SPI_MASTER_SS0_PIN      (1u)
#define I2CIF_REMOVE_SPI_MASTER_SS1_PIN      (1u)
#define I2CIF_REMOVE_SPI_MASTER_SS2_PIN      (1u)
#define I2CIF_REMOVE_SPI_MASTER_SS3_PIN      (1u)
#define I2CIF_REMOVE_SPI_SLAVE_PINS          (1u)
#define I2CIF_REMOVE_SPI_SLAVE_MOSI_PIN      (1u)
#define I2CIF_REMOVE_SPI_SLAVE_MISO_PIN      (1u)
#define I2CIF_REMOVE_UART_TX_PIN             (1u)
#define I2CIF_REMOVE_UART_RX_TX_PIN          (1u)
#define I2CIF_REMOVE_UART_RX_PIN             (1u)
#define I2CIF_REMOVE_UART_RX_WAKE_PIN        (1u)
#define I2CIF_REMOVE_UART_RTS_PIN            (1u)
#define I2CIF_REMOVE_UART_CTS_PIN            (1u)

/* Unconfigured pins */
#define I2CIF_RX_WAKE_SCL_MOSI_PIN (0u == I2CIF_REMOVE_RX_WAKE_SCL_MOSI_PIN)
#define I2CIF_RX_SCL_MOSI_PIN     (0u == I2CIF_REMOVE_RX_SCL_MOSI_PIN)
#define I2CIF_TX_SDA_MISO_PIN     (0u == I2CIF_REMOVE_TX_SDA_MISO_PIN)
#define I2CIF_CTS_SCLK_PIN     (0u == I2CIF_REMOVE_CTS_SCLK_PIN)
#define I2CIF_RTS_SS0_PIN     (0u == I2CIF_REMOVE_RTS_SS0_PIN)
#define I2CIF_SS1_PIN                (0u == I2CIF_REMOVE_SS1_PIN)
#define I2CIF_SS2_PIN                (0u == I2CIF_REMOVE_SS2_PIN)
#define I2CIF_SS3_PIN                (0u == I2CIF_REMOVE_SS3_PIN)

/* Mode defined pins */
#define I2CIF_I2C_PINS               (0u == I2CIF_REMOVE_I2C_PINS)
#define I2CIF_SPI_MASTER_PINS        (0u == I2CIF_REMOVE_SPI_MASTER_PINS)
#define I2CIF_SPI_MASTER_SCLK_PIN    (0u == I2CIF_REMOVE_SPI_MASTER_SCLK_PIN)
#define I2CIF_SPI_MASTER_MOSI_PIN    (0u == I2CIF_REMOVE_SPI_MASTER_MOSI_PIN)
#define I2CIF_SPI_MASTER_MISO_PIN    (0u == I2CIF_REMOVE_SPI_MASTER_MISO_PIN)
#define I2CIF_SPI_MASTER_SS0_PIN     (0u == I2CIF_REMOVE_SPI_MASTER_SS0_PIN)
#define I2CIF_SPI_MASTER_SS1_PIN     (0u == I2CIF_REMOVE_SPI_MASTER_SS1_PIN)
#define I2CIF_SPI_MASTER_SS2_PIN     (0u == I2CIF_REMOVE_SPI_MASTER_SS2_PIN)
#define I2CIF_SPI_MASTER_SS3_PIN     (0u == I2CIF_REMOVE_SPI_MASTER_SS3_PIN)
#define I2CIF_SPI_SLAVE_PINS         (0u == I2CIF_REMOVE_SPI_SLAVE_PINS)
#define I2CIF_SPI_SLAVE_MOSI_PIN     (0u == I2CIF_REMOVE_SPI_SLAVE_MOSI_PIN)
#define I2CIF_SPI_SLAVE_MISO_PIN     (0u == I2CIF_REMOVE_SPI_SLAVE_MISO_PIN)
#define I2CIF_UART_TX_PIN            (0u == I2CIF_REMOVE_UART_TX_PIN)
#define I2CIF_UART_RX_TX_PIN         (0u == I2CIF_REMOVE_UART_RX_TX_PIN)
#define I2CIF_UART_RX_PIN            (0u == I2CIF_REMOVE_UART_RX_PIN)
#define I2CIF_UART_RX_WAKE_PIN       (0u == I2CIF_REMOVE_UART_RX_WAKE_PIN)
#define I2CIF_UART_RTS_PIN           (0u == I2CIF_REMOVE_UART_RTS_PIN)
#define I2CIF_UART_CTS_PIN           (0u == I2CIF_REMOVE_UART_CTS_PIN)


/***************************************
*             Includes
****************************************/

#if (I2CIF_RX_WAKE_SCL_MOSI_PIN)
    #include "I2CIF_uart_rx_wake_i2c_scl_spi_mosi.h"
#endif /* (I2CIF_RX_SCL_MOSI) */

#if (I2CIF_RX_SCL_MOSI_PIN)
    #include "I2CIF_uart_rx_i2c_scl_spi_mosi.h"
#endif /* (I2CIF_RX_SCL_MOSI) */

#if (I2CIF_TX_SDA_MISO_PIN)
    #include "I2CIF_uart_tx_i2c_sda_spi_miso.h"
#endif /* (I2CIF_TX_SDA_MISO) */

#if (I2CIF_CTS_SCLK_PIN)
    #include "I2CIF_uart_cts_spi_sclk.h"
#endif /* (I2CIF_CTS_SCLK) */

#if (I2CIF_RTS_SS0_PIN)
    #include "I2CIF_uart_rts_spi_ss0.h"
#endif /* (I2CIF_RTS_SS0_PIN) */

#if (I2CIF_SS1_PIN)
    #include "I2CIF_spi_ss1.h"
#endif /* (I2CIF_SS1_PIN) */

#if (I2CIF_SS2_PIN)
    #include "I2CIF_spi_ss2.h"
#endif /* (I2CIF_SS2_PIN) */

#if (I2CIF_SS3_PIN)
    #include "I2CIF_spi_ss3.h"
#endif /* (I2CIF_SS3_PIN) */

#if (I2CIF_I2C_PINS)
    #include "I2CIF_scl.h"
    #include "I2CIF_sda.h"
#endif /* (I2CIF_I2C_PINS) */

#if (I2CIF_SPI_MASTER_PINS)
#if (I2CIF_SPI_MASTER_SCLK_PIN)
    #include "I2CIF_sclk_m.h"
#endif /* (I2CIF_SPI_MASTER_SCLK_PIN) */

#if (I2CIF_SPI_MASTER_MOSI_PIN)
    #include "I2CIF_mosi_m.h"
#endif /* (I2CIF_SPI_MASTER_MOSI_PIN) */

#if (I2CIF_SPI_MASTER_MISO_PIN)
    #include "I2CIF_miso_m.h"
#endif /*(I2CIF_SPI_MASTER_MISO_PIN) */
#endif /* (I2CIF_SPI_MASTER_PINS) */

#if (I2CIF_SPI_SLAVE_PINS)
    #include "I2CIF_sclk_s.h"
    #include "I2CIF_ss_s.h"

#if (I2CIF_SPI_SLAVE_MOSI_PIN)
    #include "I2CIF_mosi_s.h"
#endif /* (I2CIF_SPI_SLAVE_MOSI_PIN) */

#if (I2CIF_SPI_SLAVE_MISO_PIN)
    #include "I2CIF_miso_s.h"
#endif /*(I2CIF_SPI_SLAVE_MISO_PIN) */
#endif /* (I2CIF_SPI_SLAVE_PINS) */

#if (I2CIF_SPI_MASTER_SS0_PIN)
    #include "I2CIF_ss0_m.h"
#endif /* (I2CIF_SPI_MASTER_SS0_PIN) */

#if (I2CIF_SPI_MASTER_SS1_PIN)
    #include "I2CIF_ss1_m.h"
#endif /* (I2CIF_SPI_MASTER_SS1_PIN) */

#if (I2CIF_SPI_MASTER_SS2_PIN)
    #include "I2CIF_ss2_m.h"
#endif /* (I2CIF_SPI_MASTER_SS2_PIN) */

