tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF_PINS.h
#if (I2CIF_SPI_MASTER_SS3_PIN)
    #include "I2CIF_ss3_m.h"
#endif /* (I2CIF_SPI_MASTER_SS3_PIN) */

#if (I2CIF_UART_TX_PIN)
    #include "I2CIF_tx.h"
#endif /* (I2CIF_UART_TX_PIN) */

#if (I2CIF_UART_RX_TX_PIN)
    #include "I2CIF_rx_tx.h"
#endif /* (I2CIF_UART_RX_TX_PIN) */

#if (I2CIF_UART_RX_PIN)
    #include "I2CIF_rx.h"
#endif /* (I2CIF_UART_RX_PIN) */

#if (I2CIF_UART_RX_WAKE_PIN)
    #include "I2CIF_rx_wake.h"
#endif /* (I2CIF_UART_RX_WAKE_PIN) */

#if (I2CIF_UART_RTS_PIN)
    #include "I2CIF_rts.h"
#endif /* (I2CIF_UART_RTS_PIN) */

#if (I2CIF_UART_CTS_PIN)
    #include "I2CIF_cts.h"
#endif /* (I2CIF_UART_CTS_PIN) */


/***************************************
*              Registers
***************************************/

#if (I2CIF_RX_WAKE_SCL_MOSI_PIN)
    #define I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG \
                            (*(reg32 *) I2CIF_uart_rx_wake_i2c_scl_spi_mosi__0__HSIOM)
    #define I2CIF_RX_WAKE_SCL_MOSI_HSIOM_PTR \
                            ( (reg32 *) I2CIF_uart_rx_wake_i2c_scl_spi_mosi__0__HSIOM)
    #define I2CIF_RX_WAKE_SCL_MOSI_HSIOM_MASK \
                            (I2CIF_uart_rx_wake_i2c_scl_spi_mosi__0__HSIOM_MASK)
    #define I2CIF_RX_WAKE_SCL_MOSI_HSIOM_POS \
                            (I2CIF_uart_rx_wake_i2c_scl_spi_mosi__0__HSIOM_SHIFT)

    #define I2CIF_RX_WAKE_SCL_MOSI_INTCFG_REG \
                            (*(reg32 *) I2CIF_uart_rx_wake_i2c_scl_spi_mosi__0__INTCFG)
    #define I2CIF_RX_WAKE_SCL_MOSI_INTCFG_PTR \
                            ( (reg32 *) I2CIF_uart_rx_wake_i2c_scl_spi_mosi__0__INTCFG)
    #define I2CIF_RX_WAKE_SCL_MOSI_INTCFG_TYPE_POS  (I2CIF_uart_rx_wake_i2c_scl_spi_mosi__SHIFT)
    #define I2CIF_RX_WAKE_SCL_MOSI_INTCFG_TYPE_MASK \
                            ((uint32) I2CIF_INTCFG_TYPE_MASK << \
                                      I2CIF_RX_WAKE_SCL_MOSI_INTCFG_TYPE_POS)
#endif /* (I2CIF_RX_WAKE_SCL_MOSI_PIN) */

#if (I2CIF_RX_SCL_MOSI_PIN)
    #define I2CIF_RX_SCL_MOSI_HSIOM_REG   (*(reg32 *) I2CIF_uart_rx_i2c_scl_spi_mosi__0__HSIOM)
    #define I2CIF_RX_SCL_MOSI_HSIOM_PTR   ( (reg32 *) I2CIF_uart_rx_i2c_scl_spi_mosi__0__HSIOM)
    #define I2CIF_RX_SCL_MOSI_HSIOM_MASK  (I2CIF_uart_rx_i2c_scl_spi_mosi__0__HSIOM_MASK)
    #define I2CIF_RX_SCL_MOSI_HSIOM_POS   (I2CIF_uart_rx_i2c_scl_spi_mosi__0__HSIOM_SHIFT)
#endif /* (I2CIF_RX_SCL_MOSI_PIN) */

#if (I2CIF_TX_SDA_MISO_PIN)
    #define I2CIF_TX_SDA_MISO_HSIOM_REG   (*(reg32 *) I2CIF_uart_tx_i2c_sda_spi_miso__0__HSIOM)
    #define I2CIF_TX_SDA_MISO_HSIOM_PTR   ( (reg32 *) I2CIF_uart_tx_i2c_sda_spi_miso__0__HSIOM)
    #define I2CIF_TX_SDA_MISO_HSIOM_MASK  (I2CIF_uart_tx_i2c_sda_spi_miso__0__HSIOM_MASK)
    #define I2CIF_TX_SDA_MISO_HSIOM_POS   (I2CIF_uart_tx_i2c_sda_spi_miso__0__HSIOM_SHIFT)
#endif /* (I2CIF_TX_SDA_MISO_PIN) */

#if (I2CIF_CTS_SCLK_PIN)
    #define I2CIF_CTS_SCLK_HSIOM_REG   (*(reg32 *) I2CIF_uart_cts_spi_sclk__0__HSIOM)
    #define I2CIF_CTS_SCLK_HSIOM_PTR   ( (reg32 *) I2CIF_uart_cts_spi_sclk__0__HSIOM)
    #define I2CIF_CTS_SCLK_HSIOM_MASK  (I2CIF_uart_cts_spi_sclk__0__HSIOM_MASK)
    #define I2CIF_CTS_SCLK_HSIOM_POS   (I2CIF_uart_cts_spi_sclk__0__HSIOM_SHIFT)
#endif /* (I2CIF_CTS_SCLK_PIN) */

#if (I2CIF_RTS_SS0_PIN)
    #define I2CIF_RTS_SS0_HSIOM_REG   (*(reg32 *) I2CIF_uart_rts_spi_ss0__0__HSIOM)
    #define I2CIF_RTS_SS0_HSIOM_PTR   ( (reg32 *) I2CIF_uart_rts_spi_ss0__0__HSIOM)
    #define I2CIF_RTS_SS0_HSIOM_MASK  (I2CIF_uart_rts_spi_ss0__0__HSIOM_MASK)
    #define I2CIF_RTS_SS0_HSIOM_POS   (I2CIF_uart_rts_spi_ss0__0__HSIOM_SHIFT)
#endif /* (I2CIF_RTS_SS0_PIN) */

#if (I2CIF_SS1_PIN)
    #define I2CIF_SS1_HSIOM_REG      (*(reg32 *) I2CIF_spi_ss1__0__HSIOM)
    #define I2CIF_SS1_HSIOM_PTR      ( (reg32 *) I2CIF_spi_ss1__0__HSIOM)
    #define I2CIF_SS1_HSIOM_MASK     (I2CIF_spi_ss1__0__HSIOM_MASK)
    #define I2CIF_SS1_HSIOM_POS      (I2CIF_spi_ss1__0__HSIOM_SHIFT)
#endif /* (I2CIF_SS1_PIN) */

#if (I2CIF_SS2_PIN)
    #define I2CIF_SS2_HSIOM_REG     (*(reg32 *) I2CIF_spi_ss2__0__HSIOM)
    #define I2CIF_SS2_HSIOM_PTR     ( (reg32 *) I2CIF_spi_ss2__0__HSIOM)
    #define I2CIF_SS2_HSIOM_MASK    (I2CIF_spi_ss2__0__HSIOM_MASK)
    #define I2CIF_SS2_HSIOM_POS     (I2CIF_spi_ss2__0__HSIOM_SHIFT)
#endif /* (I2CIF_SS2_PIN) */

#if (I2CIF_SS3_PIN)
    #define I2CIF_SS3_HSIOM_REG     (*(reg32 *) I2CIF_spi_ss3__0__HSIOM)
    #define I2CIF_SS3_HSIOM_PTR     ( (reg32 *) I2CIF_spi_ss3__0__HSIOM)
    #define I2CIF_SS3_HSIOM_MASK    (I2CIF_spi_ss3__0__HSIOM_MASK)
    #define I2CIF_SS3_HSIOM_POS     (I2CIF_spi_ss3__0__HSIOM_SHIFT)
#endif /* (I2CIF_SS3_PIN) */

#if (I2CIF_I2C_PINS)
    #define I2CIF_SCL_HSIOM_REG     (*(reg32 *) I2CIF_scl__0__HSIOM)
    #define I2CIF_SCL_HSIOM_PTR     ( (reg32 *) I2CIF_scl__0__HSIOM)
    #define I2CIF_SCL_HSIOM_MASK    (I2CIF_scl__0__HSIOM_MASK)
    #define I2CIF_SCL_HSIOM_POS     (I2CIF_scl__0__HSIOM_SHIFT)

    #define I2CIF_SDA_HSIOM_REG     (*(reg32 *) I2CIF_sda__0__HSIOM)
    #define I2CIF_SDA_HSIOM_PTR     ( (reg32 *) I2CIF_sda__0__HSIOM)
    #define I2CIF_SDA_HSIOM_MASK    (I2CIF_sda__0__HSIOM_MASK)
    #define I2CIF_SDA_HSIOM_POS     (I2CIF_sda__0__HSIOM_SHIFT)
#endif /* (I2CIF_I2C_PINS) */

#if (I2CIF_SPI_MASTER_SCLK_PIN)
    #define I2CIF_SCLK_M_HSIOM_REG   (*(reg32 *) I2CIF_sclk_m__0__HSIOM)
    #define I2CIF_SCLK_M_HSIOM_PTR   ( (reg32 *) I2CIF_sclk_m__0__HSIOM)
    #define I2CIF_SCLK_M_HSIOM_MASK  (I2CIF_sclk_m__0__HSIOM_MASK)
    #define I2CIF_SCLK_M_HSIOM_POS   (I2CIF_sclk_m__0__HSIOM_SHIFT)
#endif /* (I2CIF_SPI_MASTER_SCLK_PIN) */

#if (I2CIF_SPI_MASTER_SS0_PIN)
    #define I2CIF_SS0_M_HSIOM_REG    (*(reg32 *) I2CIF_ss0_m__0__HSIOM)
    #define I2CIF_SS0_M_HSIOM_PTR    ( (reg32 *) I2CIF_ss0_m__0__HSIOM)
    #define I2CIF_SS0_M_HSIOM_MASK   (I2CIF_ss0_m__0__HSIOM_MASK)
    #define I2CIF_SS0_M_HSIOM_POS    (I2CIF_ss0_m__0__HSIOM_SHIFT)
#endif /* (I2CIF_SPI_MASTER_SS0_PIN) */

#if (I2CIF_SPI_MASTER_SS1_PIN)
    #define I2CIF_SS1_M_HSIOM_REG    (*(reg32 *) I2CIF_ss1_m__0__HSIOM)
    #define I2CIF_SS1_M_HSIOM_PTR    ( (reg32 *) I2CIF_ss1_m__0__HSIOM)
    #define I2CIF_SS1_M_HSIOM_MASK   (I2CIF_ss1_m__0__HSIOM_MASK)
    #define I2CIF_SS1_M_HSIOM_POS    (I2CIF_ss1_m__0__HSIOM_SHIFT)
#endif /* (I2CIF_SPI_MASTER_SS1_PIN) */

#if (I2CIF_SPI_MASTER_SS2_PIN)
    #define I2CIF_SS2_M_HSIOM_REG    (*(reg32 *) I2CIF_ss2_m__0__HSIOM)
    #define I2CIF_SS2_M_HSIOM_PTR    ( (reg32 *) I2CIF_ss2_m__0__HSIOM)
    #define I2CIF_SS2_M_HSIOM_MASK   (I2CIF_ss2_m__0__HSIOM_MASK)
    #define I2CIF_SS2_M_HSIOM_POS    (I2CIF_ss2_m__0__HSIOM_SHIFT)
#endif /* (I2CIF_SPI_MASTER_SS2_PIN) */

