tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF_PINS.h
#if (I2CIF_SPI_MASTER_SS3_PIN)
    #define I2CIF_SS3_M_HSIOM_REG    (*(reg32 *) I2CIF_ss3_m__0__HSIOM)
    #define I2CIF_SS3_M_HSIOM_PTR    ( (reg32 *) I2CIF_ss3_m__0__HSIOM)
    #define I2CIF_SS3_M_HSIOM_MASK   (I2CIF_ss3_m__0__HSIOM_MASK)
    #define I2CIF_SS3_M_HSIOM_POS    (I2CIF_ss3_m__0__HSIOM_SHIFT)
#endif /* (I2CIF_SPI_MASTER_SS3_PIN) */

#if (I2CIF_UART_TX_PIN)
    #define I2CIF_TX_HSIOM_REG   (*(reg32 *) I2CIF_tx__0__HSIOM)
    #define I2CIF_TX_HSIOM_PTR   ( (reg32 *) I2CIF_tx_0__HSIOM)
    #define I2CIF_TX_HSIOM_MASK  (I2CIF_tx__0__HSIOM_MASK)
    #define I2CIF_TX_HSIOM_POS   (I2CIF_tx__0__HSIOM_SHIFT)
#endif /* (I2CIF_UART_TX_PIN) */

#if (I2CIF_UART_RTS_PIN)
    #define I2CIF_RTS_HSIOM_REG  (*(reg32 *) I2CIF_rts__0__HSIOM)
    #define I2CIF_RTS_HSIOM_PTR  ( (reg32 *) I2CIF_rts__0__HSIOM)
    #define I2CIF_RTS_HSIOM_MASK (I2CIF_rts__0__HSIOM_MASK)
    #define I2CIF_RTS_HSIOM_POS  (I2CIF_rts__0__HSIOM_SHIFT)
#endif /* (I2CIF_UART_RTS_PIN) */


/***************************************
*        Registers Constants
***************************************/

/* Pins constants */
#define I2CIF_HSIOM_DEF_SEL      (0x00u)
#define I2CIF_HSIOM_GPIO_SEL     (0x00u)
#define I2CIF_HSIOM_UART_SEL     (0x09u)
#define I2CIF_HSIOM_I2C_SEL      (0x0Eu)
#define I2CIF_HSIOM_SPI_SEL      (0x0Fu)

#define I2CIF_RX_WAKE_SCL_MOSI_PIN_INDEX   (0u)
#define I2CIF_RX_SCL_MOSI_PIN_INDEX       (0u)
#define I2CIF_TX_SDA_MISO_PIN_INDEX       (1u)
#define I2CIF_CTS_SCLK_PIN_INDEX       (2u)
#define I2CIF_RTS_SS0_PIN_INDEX       (3u)
#define I2CIF_SS1_PIN_INDEX                  (4u)
#define I2CIF_SS2_PIN_INDEX                  (5u)
#define I2CIF_SS3_PIN_INDEX                  (6u)

#define I2CIF_RX_WAKE_SCL_MOSI_PIN_MASK ((uint32) 0x01u << I2CIF_RX_WAKE_SCL_MOSI_PIN_INDEX)
#define I2CIF_RX_SCL_MOSI_PIN_MASK     ((uint32) 0x01u << I2CIF_RX_SCL_MOSI_PIN_INDEX)
#define I2CIF_TX_SDA_MISO_PIN_MASK     ((uint32) 0x01u << I2CIF_TX_SDA_MISO_PIN_INDEX)
#define I2CIF_CTS_SCLK_PIN_MASK     ((uint32) 0x01u << I2CIF_CTS_SCLK_PIN_INDEX)
#define I2CIF_RTS_SS0_PIN_MASK     ((uint32) 0x01u << I2CIF_RTS_SS0_PIN_INDEX)
#define I2CIF_SS1_PIN_MASK                ((uint32) 0x01u << I2CIF_SS1_PIN_INDEX)
#define I2CIF_SS2_PIN_MASK                ((uint32) 0x01u << I2CIF_SS2_PIN_INDEX)
#define I2CIF_SS3_PIN_MASK                ((uint32) 0x01u << I2CIF_SS3_PIN_INDEX)

/* Pin interrupt constants */
#define I2CIF_INTCFG_TYPE_MASK           (0x03u)
#define I2CIF_INTCFG_TYPE_FALLING_EDGE   (0x02u)

/* Pin Drive Mode constants */
#define I2CIF_PIN_DM_ALG_HIZ  (0u)
#define I2CIF_PIN_DM_DIG_HIZ  (1u)
#define I2CIF_PIN_DM_OD_LO    (4u)
#define I2CIF_PIN_DM_STRONG   (6u)


/***************************************
*          Macro Definitions
***************************************/

/* Return drive mode of the pin */
#define I2CIF_DM_MASK    (0x7u)
#define I2CIF_DM_SIZE    (3)
#define I2CIF_GET_P4_PIN_DM(reg, pos) \
    ( ((reg) & (uint32) ((uint32) I2CIF_DM_MASK << (I2CIF_DM_SIZE * (pos)))) >> \
                                                              (I2CIF_DM_SIZE * (pos)) )

#if (I2CIF_TX_SDA_MISO_PIN)
    #define I2CIF_CHECK_TX_SDA_MISO_PIN_USED \
                (I2CIF_PIN_DM_ALG_HIZ != \
                    I2CIF_GET_P4_PIN_DM(I2CIF_uart_tx_i2c_sda_spi_miso_PC, \
                                                   I2CIF_uart_tx_i2c_sda_spi_miso_SHIFT))
#endif /* (I2CIF_TX_SDA_MISO_PIN) */

#if (I2CIF_RTS_SS0_PIN)
    #define I2CIF_CHECK_RTS_SS0_PIN_USED \
                (I2CIF_PIN_DM_ALG_HIZ != \
                    I2CIF_GET_P4_PIN_DM(I2CIF_uart_rts_spi_ss0_PC, \
                                                   I2CIF_uart_rts_spi_ss0_SHIFT))
#endif /* (I2CIF_RTS_SS0_PIN) */

/* Set bits-mask in register */
#define I2CIF_SET_REGISTER_BITS(reg, mask, pos, mode) \
                    do                                           \
                    {                                            \
                        (reg) = (((reg) & ((uint32) ~(uint32) (mask))) | ((uint32) ((uint32) (mode) << (pos)))); \
                    }while(0)

/* Set bit in the register */
#define I2CIF_SET_REGISTER_BIT(reg, mask, val) \
                    ((val) ? ((reg) |= (mask)) : ((reg) &= ((uint32) ~((uint32) (mask)))))

#define I2CIF_SET_HSIOM_SEL(reg, mask, pos, sel) I2CIF_SET_REGISTER_BITS(reg, mask, pos, sel)
#define I2CIF_SET_INCFG_TYPE(reg, mask, pos, intType) \
                                                        I2CIF_SET_REGISTER_BITS(reg, mask, pos, intType)
#define I2CIF_SET_INP_DIS(reg, mask, val) I2CIF_SET_REGISTER_BIT(reg, mask, val)

/* I2CIF_SET_I2C_SCL_DR(val) - Sets I2C SCL DR register.
*  I2CIF_SET_I2C_SCL_HSIOM_SEL(sel) - Sets I2C SCL HSIOM settings.
*/
/* SCB I2C: scl signal */
#if (I2CIF_CY_SCBIP_V0)
#if (I2CIF_I2C_PINS)
    #define I2CIF_SET_I2C_SCL_DR(val) I2CIF_scl_Write(val)

    #define I2CIF_SET_I2C_SCL_HSIOM_SEL(sel) \
                          I2CIF_SET_HSIOM_SEL(I2CIF_SCL_HSIOM_REG,  \
                                                         I2CIF_SCL_HSIOM_MASK, \
                                                         I2CIF_SCL_HSIOM_POS,  \
                                                         (sel))
    #define I2CIF_WAIT_SCL_SET_HIGH  (0u == I2CIF_scl_Read())

/* Unconfigured SCB: scl signal */
#elif (I2CIF_RX_WAKE_SCL_MOSI_PIN)
    #define I2CIF_SET_I2C_SCL_DR(val) \
                            I2CIF_uart_rx_wake_i2c_scl_spi_mosi_Write(val)

    #define I2CIF_SET_I2C_SCL_HSIOM_SEL(sel) \
                    I2CIF_SET_HSIOM_SEL(I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG,  \
                                                   I2CIF_RX_WAKE_SCL_MOSI_HSIOM_MASK, \
                                                   I2CIF_RX_WAKE_SCL_MOSI_HSIOM_POS,  \
                                                   (sel))

    #define I2CIF_WAIT_SCL_SET_HIGH  (0u == I2CIF_uart_rx_wake_i2c_scl_spi_mosi_Read())

