tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF_PINS.h
#elif (I2CIF_RX_SCL_MOSI_PIN)
    #define I2CIF_SET_I2C_SCL_DR(val) \
                            I2CIF_uart_rx_i2c_scl_spi_mosi_Write(val)


    #define I2CIF_SET_I2C_SCL_HSIOM_SEL(sel) \
                            I2CIF_SET_HSIOM_SEL(I2CIF_RX_SCL_MOSI_HSIOM_REG,  \
                                                           I2CIF_RX_SCL_MOSI_HSIOM_MASK, \
                                                           I2CIF_RX_SCL_MOSI_HSIOM_POS,  \
                                                           (sel))

    #define I2CIF_WAIT_SCL_SET_HIGH  (0u == I2CIF_uart_rx_i2c_scl_spi_mosi_Read())

#else
    #define I2CIF_SET_I2C_SCL_DR(val) \
                                                    do{ /* Does nothing */ }while(0)
    #define I2CIF_SET_I2C_SCL_HSIOM_SEL(sel) \
                                                    do{ /* Does nothing */ }while(0)

    #define I2CIF_WAIT_SCL_SET_HIGH  (0u)
#endif /* (I2CIF_I2C_PINS) */

/* SCB I2C: sda signal */
#if (I2CIF_I2C_PINS)
    #define I2CIF_WAIT_SDA_SET_HIGH  (0u == I2CIF_sda_Read())
/* Unconfigured SCB: sda signal */
#elif (I2CIF_TX_SDA_MISO_PIN)
    #define I2CIF_WAIT_SDA_SET_HIGH  (0u == I2CIF_uart_tx_i2c_sda_spi_miso_Read())
#else
    #define I2CIF_WAIT_SDA_SET_HIGH  (0u)
#endif /* (I2CIF_MOSI_SCL_RX_PIN) */
#endif /* (I2CIF_CY_SCBIP_V0) */


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

/* Unconfigured pins */
#define I2CIF_REMOVE_MOSI_SCL_RX_WAKE_PIN    I2CIF_REMOVE_RX_WAKE_SCL_MOSI_PIN
#define I2CIF_REMOVE_MOSI_SCL_RX_PIN         I2CIF_REMOVE_RX_SCL_MOSI_PIN
#define I2CIF_REMOVE_MISO_SDA_TX_PIN         I2CIF_REMOVE_TX_SDA_MISO_PIN
#ifndef I2CIF_REMOVE_SCLK_PIN
#define I2CIF_REMOVE_SCLK_PIN                I2CIF_REMOVE_CTS_SCLK_PIN
#endif /* I2CIF_REMOVE_SCLK_PIN */
#ifndef I2CIF_REMOVE_SS0_PIN
#define I2CIF_REMOVE_SS0_PIN                 I2CIF_REMOVE_RTS_SS0_PIN
#endif /* I2CIF_REMOVE_SS0_PIN */

/* Unconfigured pins */
#define I2CIF_MOSI_SCL_RX_WAKE_PIN   I2CIF_RX_WAKE_SCL_MOSI_PIN
#define I2CIF_MOSI_SCL_RX_PIN        I2CIF_RX_SCL_MOSI_PIN
#define I2CIF_MISO_SDA_TX_PIN        I2CIF_TX_SDA_MISO_PIN
#ifndef I2CIF_SCLK_PIN
#define I2CIF_SCLK_PIN               I2CIF_CTS_SCLK_PIN
#endif /* I2CIF_SCLK_PIN */
#ifndef I2CIF_SS0_PIN
#define I2CIF_SS0_PIN                I2CIF_RTS_SS0_PIN
#endif /* I2CIF_SS0_PIN */

#if (I2CIF_MOSI_SCL_RX_WAKE_PIN)
    #define I2CIF_MOSI_SCL_RX_WAKE_HSIOM_REG     I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG
    #define I2CIF_MOSI_SCL_RX_WAKE_HSIOM_PTR     I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG
    #define I2CIF_MOSI_SCL_RX_WAKE_HSIOM_MASK    I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG
    #define I2CIF_MOSI_SCL_RX_WAKE_HSIOM_POS     I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG

    #define I2CIF_MOSI_SCL_RX_WAKE_INTCFG_REG    I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG
    #define I2CIF_MOSI_SCL_RX_WAKE_INTCFG_PTR    I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG

    #define I2CIF_MOSI_SCL_RX_WAKE_INTCFG_TYPE_POS   I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG
    #define I2CIF_MOSI_SCL_RX_WAKE_INTCFG_TYPE_MASK  I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG
#endif /* (I2CIF_RX_WAKE_SCL_MOSI_PIN) */

#if (I2CIF_MOSI_SCL_RX_PIN)
    #define I2CIF_MOSI_SCL_RX_HSIOM_REG      I2CIF_RX_SCL_MOSI_HSIOM_REG
    #define I2CIF_MOSI_SCL_RX_HSIOM_PTR      I2CIF_RX_SCL_MOSI_HSIOM_PTR
    #define I2CIF_MOSI_SCL_RX_HSIOM_MASK     I2CIF_RX_SCL_MOSI_HSIOM_MASK
    #define I2CIF_MOSI_SCL_RX_HSIOM_POS      I2CIF_RX_SCL_MOSI_HSIOM_POS
#endif /* (I2CIF_MOSI_SCL_RX_PIN) */

#if (I2CIF_MISO_SDA_TX_PIN)
    #define I2CIF_MISO_SDA_TX_HSIOM_REG      I2CIF_TX_SDA_MISO_HSIOM_REG
    #define I2CIF_MISO_SDA_TX_HSIOM_PTR      I2CIF_TX_SDA_MISO_HSIOM_REG
    #define I2CIF_MISO_SDA_TX_HSIOM_MASK     I2CIF_TX_SDA_MISO_HSIOM_REG
    #define I2CIF_MISO_SDA_TX_HSIOM_POS      I2CIF_TX_SDA_MISO_HSIOM_REG
#endif /* (I2CIF_MISO_SDA_TX_PIN_PIN) */

#if (I2CIF_SCLK_PIN)
    #ifndef I2CIF_SCLK_HSIOM_REG
    #define I2CIF_SCLK_HSIOM_REG     I2CIF_CTS_SCLK_HSIOM_REG
    #define I2CIF_SCLK_HSIOM_PTR     I2CIF_CTS_SCLK_HSIOM_PTR
    #define I2CIF_SCLK_HSIOM_MASK    I2CIF_CTS_SCLK_HSIOM_MASK
    #define I2CIF_SCLK_HSIOM_POS     I2CIF_CTS_SCLK_HSIOM_POS
    #endif /* I2CIF_SCLK_HSIOM_REG */
#endif /* (I2CIF_SCLK_PIN) */

#if (I2CIF_SS0_PIN)
    #ifndef I2CIF_SS0_HSIOM_REG
    #define I2CIF_SS0_HSIOM_REG      I2CIF_RTS_SS0_HSIOM_REG
    #define I2CIF_SS0_HSIOM_PTR      I2CIF_RTS_SS0_HSIOM_PTR
    #define I2CIF_SS0_HSIOM_MASK     I2CIF_RTS_SS0_HSIOM_MASK
    #define I2CIF_SS0_HSIOM_POS      I2CIF_RTS_SS0_HSIOM_POS
    #endif /* I2CIF_SS0_HSIOM_REG */
#endif /* (I2CIF_SS0_PIN) */

#define I2CIF_MOSI_SCL_RX_WAKE_PIN_INDEX I2CIF_RX_WAKE_SCL_MOSI_PIN_INDEX
#define I2CIF_MOSI_SCL_RX_PIN_INDEX      I2CIF_RX_SCL_MOSI_PIN_INDEX
#define I2CIF_MISO_SDA_TX_PIN_INDEX      I2CIF_TX_SDA_MISO_PIN_INDEX
#ifndef I2CIF_SCLK_PIN_INDEX
#define I2CIF_SCLK_PIN_INDEX             I2CIF_CTS_SCLK_PIN_INDEX
#endif /* I2CIF_SCLK_PIN_INDEX */
#ifndef I2CIF_SS0_PIN_INDEX
#define I2CIF_SS0_PIN_INDEX              I2CIF_RTS_SS0_PIN_INDEX
#endif /* I2CIF_SS0_PIN_INDEX */

#define I2CIF_MOSI_SCL_RX_WAKE_PIN_MASK I2CIF_RX_WAKE_SCL_MOSI_PIN_MASK
#define I2CIF_MOSI_SCL_RX_PIN_MASK      I2CIF_RX_SCL_MOSI_PIN_MASK
#define I2CIF_MISO_SDA_TX_PIN_MASK      I2CIF_TX_SDA_MISO_PIN_MASK
#ifndef I2CIF_SCLK_PIN_MASK
#define I2CIF_SCLK_PIN_MASK             I2CIF_CTS_SCLK_PIN_MASK
#endif /* I2CIF_SCLK_PIN_MASK */
#ifndef I2CIF_SS0_PIN_MASK
#define I2CIF_SS0_PIN_MASK              I2CIF_RTS_SS0_PIN_MASK
#endif /* I2CIF_SS0_PIN_MASK */

#endif /* (CY_SCB_PINS_I2CIF_H) */


/* [] END OF FILE */
